Tekla.Structures.Model.Solid.SolidQueryTypeEnum
Solid query type enumeration.

Tekla.Structures.Model.Solid.SolidQueryTypeEnum.SOLID_GET_EXTREMA_MIN
Get extrema min.

Tekla.Structures.Model.Solid.SolidQueryTypeEnum.SOLID_GET_EXTREMA_MAX
Get extrema max.

Tekla.Structures.Model.Solid.SolidQueryTypeEnum.SOLID_GET_SOLID_DATA
Get solid data.

Tekla.Structures.Model.Solid.SolidQueryTypeEnum.SOLID_GET_FACE_NORMAL
Get face normal.

Tekla.Structures.Model.Solid.SolidQueryTypeEnum.SOLID_GET_EDGES
Get edges.